# ========================
#                 formulae
# ========================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"


# ========================
#                     brew
# ========================
brew "mas"

brew "neovim", args: ["HEAD"]
brew "ghq"
brew "jq"
brew "peco"
brew "tmux"
brew "zsh"
brew "zplug"
brew "exa"
brew "fzf"
brew "bat"

brew "git"
brew "awscli"
brew "anyenv"
brew "go"
brew "kotlin"
brew "gradle"


# ========================
#                     cask
# ========================
cask "google-chrome"
cask "google-japanese-ime"
cask "alfred"
cask "bettertouchtool"
cask "hyperswitch"
cask "authy"
cask "kindle"
cask "karabiner-elements"
cask "1password"

# -----------------
#               dev
# -----------------
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "corretto"
cask "intellij-idea"

# -----------------
#               mas
# -----------------
mas "BetterSnapTool", id: 417375580
mas "Slack", id: 803453959
